app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Grocery Shop "], ["description", "Don't forget bacon SERIOUSLY"], ["updated_at", "2017-09-20 22:19:19.136204"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.update(task_params)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "completion_date") VALUES (?, ?, ?, ?, ?)  [["name", "Go to gym"], ["description", "today after school"], ["created_at", "2017-09-20 18:00:06.712150"], ["updated_at", "2017-09-20 18:00:06.712150"], ["completion_date", "2017-09-21"]]
---
    task = Task.new(task_params)
    task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "task_completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "f"], ["task_completion_date", "2017-09-22"], ["updated_at", "2017-09-22 19:19:23.204956"], ["id", 14]]
---
  def mark_complete
    @task = Task.find(params[:id])
    @task.status = false
    @task.task_completion_date = DateTime.now
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "t"], ["updated_at", "2017-09-20 20:39:44.835220"], ["id", 2]]
---
  def unmark_complete
    @task = Task.find(params[:id])
    @task.status = true
    @task.save